# Pandas: -

In [3]:
import numpy as np
import pandas as pd

In [6]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
dict = {'a': 10, 'b': 20, 'c': 30}

## Series: -

In [12]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [15]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [24]:
series1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])
series1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [26]:
series2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])
series2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [28]:
series1['USA']

1

## Data Frames: -

In [30]:
np.random.seed(101)

In [35]:
df = pd.DataFrame(np.random.randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [37]:
df['W']

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [41]:
type(df['W'])

pandas.core.series.Series

In [43]:
df.W

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [46]:
df[['W', 'X']]

          W         X
A  0.386030  2.084019
B  0.681209  1.035125
C -1.005187 -0.741790
D -1.382920  1.482495
E  0.992573  1.192241

In [63]:
df['Div'] = df['W'] / df['Y']
df['Div']

A    -1.025262
B   -21.861321
C    -5.371754
D    -1.438357
E    -0.948216
Name: Div, dtype: float64

In [64]:
df

          W         X         Y         Z        Div
A  0.386030  2.084019 -0.376519  0.230336  -1.025262
B  0.681209  1.035125 -0.031160  1.939932 -21.861321
C -1.005187 -0.741790  0.187125 -0.732845  -5.371754
D -1.382920  1.482495  0.961458 -2.141212  -1.438357
E  0.992573  1.192241 -1.046780  1.292765  -0.948216

In [65]:
df.drop('Div', axis=1, inplace=True)

In [66]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

## Selection in Data Frames: -

In [68]:
df.loc['A']

W    0.386030
X    2.084019
Y   -0.376519
Z    0.230336
Name: A, dtype: float64

In [70]:
df.iloc[0]

W    0.386030
X    2.084019
Y   -0.376519
Z    0.230336
Name: A, dtype: float64

In [72]:
df.loc['C', 'Y']

0.1871245217641948

In [74]:
df.loc[['B', 'D'], ['X', 'Y']]

          X         Y
B  1.035125 -0.031160
D  1.482495  0.961458

In [77]:
bool_df = df > 0
bool_df

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [79]:
df[bool_df]

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [81]:
df[df>0]

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [83]:
df[df['W']>0]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [86]:
df[df['W']>0][['X','Y']]

          X         Y
A  2.084019 -0.376519
B  1.035125 -0.031160
E  1.192241 -1.046780

In [90]:
bool_ser = df['W']>0
result = df[bool_ser]
result

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [93]:
df[(df['W']>0) & (df['X']>1)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

## Indexing in Data Frames: -

In [95]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [98]:
newInd = "CA NY WY OR CO".split()
newInd

['CA', 'NY', 'WY', 'OR', 'CO']

In [101]:
df['States'] = newInd
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

In [103]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

In [105]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

## Index Levels: -

In [107]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
higher_index = list(zip(outside, inside))
higher_index = pd.MultiIndex.from_tuples(higher_index)

In [109]:
higher_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [112]:
df2 = pd.DataFrame(pd.DataFrame(np.random.randn(6, 2), higher_index, ['A', 'B']))
df2

             A         B
G1 1  0.641806 -0.905100
   2 -0.391157  1.028293
   3 -1.972605 -0.866885
G2 1  0.720788 -1.223082
   2  1.606780 -1.115710
   3 -1.385379 -1.329660

In [116]:
df2.loc['G1']

          A         B
1  0.641806 -0.905100
2 -0.391157  1.028293
3 -1.972605 -0.866885

In [118]:
df2.loc['G1'].loc[1]

A    0.641806
B   -0.905100
Name: 1, dtype: float64

In [122]:
df2.index.names = ['Groups', 'Num']
df2

                   A         B
Groups Num
G1     1    0.641806 -0.905100
       2   -0.391157  1.028293
       3   -1.972605 -0.866885
G2     1    0.720788 -1.223082
       2    1.606780 -1.115710
       3   -1.385379 -1.329660

In [124]:
df2.loc['G2'].loc[2]['B']

-1.1157099674628352

In [128]:
df2.xs

<bound method NDFrame.xs of                    A         B
Groups Num
G1     1    0.641806 -0.905100
       2   -0.391157  1.028293
       3   -1.972605 -0.866885
G2     1    0.720788 -1.223082
       2    1.606780 -1.115710
       3   -1.385379 -1.329660>

In [130]:
df2.xs(1, level='Num')

               A         B
Groups
G1      0.641806 -0.905100
G2      0.720788 -1.223082

## Missing Data: -

In [133]:
missing_dict = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}
missing_dict

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [135]:
missing_df = pd.DataFrame(missing_dict)
missing_df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [138]:
missing_df.dropna()

     A    B  C
0  1.0  5.0  1

In [140]:
missing_df.dropna(axis=1)

   C
0  1
1  2
2  3

In [143]:
missing_df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [145]:
missing_df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [151]:
missing_df['A'].fillna(value=missing_df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group By: -

In [153]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'], 
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Car', 'Sarah'], 
        'Sales': [200, 120, 340, 124, 243, 350]}
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Car', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [155]:
group_df = pd.DataFrame(data)
group_df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB      Car    243
5      FB    Sarah    350

In [159]:
comp_group = group_df.groupby('Company')
comp_group

In [161]:
comp_group.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [163]:
comp_group.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

### Standard Deviation: -

In [165]:
comp_group.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [167]:
group_df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [169]:
group_df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## Different Operations: -

In [171]:
merge_df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                         'B': ['B0', 'B1', 'B2', 'B3'],
                         'C': ['C0', 'C1', 'C2', 'C3'], 
                         'D': ['D0', 'D1', 'D2', 'D3']}, 
                        index=[0, 1, 2, 3])
merge_df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [174]:
merge_df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'], 
                         'B': ['B4', 'B5', 'B6', 'B7'],
                         'C': ['C4', 'C5', 'C6', 'C7'], 
                         'D': ['D4', 'D5', 'D6', 'D7']}, 
                        index=[4, 5, 6, 7])
merge_df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [175]:
merge_df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'], 
                         'B': ['B8', 'B9', 'B10', 'B11'],
                         'C': ['C8', 'C9', 'C10', 'C11'], 
                         'D': ['D8', 'D9', 'D10', 'D11']}, 
                        index=[8, 9, 10, 11])
merge_df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatination: -

In [178]:
pd.concat([merge_df1, merge_df2, merge_df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [180]:
pd.concat([merge_df1, merge_df2, merge_df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging: -

In [182]:
left_df = pd.DataFrame({'Key': ['K0', 'K1', 'K2', 'K3'], 
                       'A': ['A0', 'A1', 'A2', 'A3'],
                       'B': ['B0', 'B1', 'B2', 'B3']})
left_df

  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [184]:
right_df = pd.DataFrame({'Key': ['K0', 'K1', 'K2', 'K3'], 
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
right_df

  Key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [187]:
pd.merge(left_df, right_df, how='inner', on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### Joining: -

In [192]:
join_left_df = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                       'B': ['B0', 'B1', 'B2']},
                           index=['K0', 'K1', 'K2'])
join_left_df

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [191]:
join_right_df = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                       'D': ['D0', 'D2', 'D3']}, 
                            index=['K0', 'K2', 'K3'])
join_right_df

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [194]:
join_left_df.join(join_right_df)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [196]:
join_right_df.join(join_left_df)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [201]:
ope_df = pd.DataFrame({'col1':[1, 2, 3, 4],
                      'col2': [444, 555, 666, 444],
                      'col3': ['abc', 'def', 'ghi', 'jkl']})
ope_df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [206]:
ope_df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [208]:
ope_df['col2'].nunique()

3

In [211]:
ope_df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [215]:
ope_df[ope_df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  jkl

In [217]:
ope_df[(ope_df['col1']>2) & (ope_df['col2']==444)]

   col1  col2 col3
3     4   444  jkl

In [218]:
def times_2(x):
    return x * 2

In [220]:
ope_df['col1'].sum()

10

In [222]:
ope_df['col1'].apply(times_2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [225]:
ope_df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [228]:
ope_df['col2'].apply(lambda x: x * 2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [230]:
ope_df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  jkl

In [232]:
ope_df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [234]:
ope_df.index

RangeIndex(start=0, stop=4, step=1)

In [236]:
ope_df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi

In [240]:
ope_df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [243]:
pivote_data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
         'B': ['one', 'one','two','two', 'one', 'one'], 
         'C': ['x', 'y', 'x', 'y', 'x', 'y'], 
         'D': [1, 3, 2, 5, 4, 1]}
pivote_df = pd.DataFrame(pivote_data)
pivote_df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [245]:
pivote_df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data Input and Output: -

In [246]:
pwd

'C:\\Users\\vivek\\Documents\\numpy_tutorials'

In [252]:
csv_df = pd.read_csv('data_in_out.csv')
csv_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [257]:
csv_df.to_csv('My_csv_Data_Out.csv', index=False)

In [259]:
pd.read_csv('My_csv_Data_Out.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [262]:
xlsx_df = pd.read_excel('data_in_out.xlsx')
xlsx_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [267]:
xlsx_df.to_excel('My_Excel_Data_Out.xlsx', sheet_name='MyDataSheet', index=False)

In [269]:
pd.read_excel('My_Excel_Data_Out.xlsx')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [274]:
html_df = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [276]:
type(html_df)

list

In [279]:
html_df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","June 18, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","July 24, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

In [280]:
from sqlalchemy import create_engine

In [281]:
engine = create_engine('sqlite:///:memory:')

In [286]:
csv_df.to_sql('My_Excel_Data_Out', engine)

ValueError: Table 'My_Excel_Data_Out' already exists.

In [287]:
sql_df = pd.read_sql('My_Excel_Data_Out', con=engine)
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15